In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import importlib
import data_cleaning
from data_cleaning import *
%matplotlib inline

In [2]:
dfs = {}
for table_name in TABLE_FORMATS.keys():
    dfs[table_name] = df_from_movie_csv(table_name)

In [52]:
mdf = dfs['imdb.title.basics'].copy()
test = mdf.head()

In [5]:
mdf[mdf.original_title=='Moonlight']

          primary_title original_title  start_year  runtime_minutes  genres
tconst
tt4975722     Moonlight      Moonlight        2016            111.0   Drama
tt5934182     Moonlight      Moonlight        2011             87.0  Horror

In [13]:
sung = mdf[mdf.original_title=='Sunghursh'].reset_index().copy()
sung

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"

In [53]:
test

,primary_title,original_title,start_year,runtime_minutes,genres
tconst,,,,,
tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [66]:
test.columns.drop('genres')

Index(['primary_title', 'original_title', 'start_year', 'runtime_minutes'], dtype='object')

In [83]:
test.genres.apply(lambda x: [str.strip("[']") for str in x.split(",")]) \
           .apply(pd.Series) \
           .merge(test, left_index = True, right_index = True) \
           .reset_index() \
           .drop(["genres"], axis = 1) \
           .melt(id_vars = test.reset_index().columns.drop('genres'), value_name = "genre") \
           .drop("variable", axis = 1) \
           .dropna() \
           .set_index('tconst') \
           .sort_values(by=['tconst','genre'])

,primary_title,original_title,start_year,runtime_minutes,genre
tconst,,,,,
tt0063540,Sunghursh,Sunghursh,2013,175.0,Action
tt0063540,Sunghursh,Sunghursh,2013,175.0,Crime
tt0063540,Sunghursh,Sunghursh,2013,175.0,Drama
tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,Biography
tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,Drama
tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,Comedy
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,Drama
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,Fantasy

In [29]:
gs = ['Action','Crime','Drama']
pd.Series(gs)

0    Action
1     Crime
2     Drama
dtype: object

In [35]:
df = pd.DataFrame([[2,2],[2,2]],columns=['a','genres'])

In [36]:
df

   a  genres
0  2       2
1  2       2

In [37]:
df.genres[0]=gs

In [38]:
df

   a                  genres
0  2  [Action, Crime, Drama]
1  2                       2

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
a         2 non-null int64
genres    2 non-null object
dtypes: int64(1), object(1)
memory usage: 112.0+ bytes

In [40]:
df.genres[1]

2

In [41]:
pd.Series(df.genres[0])

0    Action
1     Crime
2     Drama
dtype: object

In [43]:
pd.dtype(df.genres[0])

AttributeError: module 'pandas' has no attribute 'dtype'